Revit 2026 API

# DirectShapeSetName Method

---

Sets the name for the DirectShape element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetName(
	string name
)
```
```vb
Public Sub SetName (
	name As String
)
```
```cpp
public:
void SetName(
	String^ name
)
```
```fsharp
member SetName :
        name : string -> unit
```

#### Parameters

name String
     The name.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

DirectShape Class

Autodesk.Revit.DB Namespace